# Пользователь вводит две строки, необходимо вывести склеенные строки и количество символов склеенной строки
string1 = input()
string2 = input()
print(f"Результат сложения строк = {string1 + " " + string2}. Всего символов: {len(string1) + len(string2)}.")